---
type: MEPSpaceConstruction
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 5
tags: [revit-api, class]
---

# MEPSpaceConstruction

`Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | DeleteConstruction | — | `public void DeleteConstruction ( MEPBuildingConstruction pCurrentConstruction )` |
| Method | DuplicateConstruction | — | `public MEPBuildingConstruction DuplicateConstruction ( MEPBuildingConstruction pCurrentConstruction , string pName )` |
| Method | NewConstruction | — | `public MEPBuildingConstruction NewConstruction ( string pName )` |
| Property | CurrentConstruction | — | `public MEPBuildingConstruction CurrentConstruction { get ; set ; }` |
| Property | SpaceConstructions | — | `public MEPBuildingConstructionSet SpaceConstructions { get ; }` |